src/InformationRegisters/ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля/ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля</name>
  <comment>История технического обслуживания и ремонта экземпляров комплектующих изделий корабля</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТрудоемкостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудоемкостьСопутствующихРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительРабот</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РесурсыИСрокиСлужбыПредметовСнабжения/РесурсыИСрокиСлужбыПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РесурсыИСрокиСлужбыПредметовСнабжения</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ТипыПоказателейИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НаработкаЭкземляровКомплектующихИзделийКорабля/НаработкаЭкземляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаработкаЭкземляровКомплектующихИзделийКорабля</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеСНачалаЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоЦикла</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияТОиРЭкземпляровКомплектующихИзделийКорабля/Forms/ФормаВводаНаработки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Дата", Дата);
	Параметры.Свойство("Экземпляр", Экземпляр);
	
	ЗаполнитьНаработку();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаработку()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПараметрУчета КАК ПараметрУчета,
	|	МАКСИМУМ(РесурсыИСрокиСлужбыПредметовСнабжения.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	&Экземпляр КАК Экземпляр,
	|	&Период КАК Период
	|ПОМЕСТИТЬ втНаработка
	|ИЗ
	|	РегистрСведений.РесурсыИСрокиСлужбыПредметовСнабжения КАК РесурсыИСрокиСлужбыПредметовСнабжения
	|ГДЕ
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПредметСнабжения = &ПредметСнабжения
	|
	|СГРУППИРОВАТЬ ПО
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПараметрУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПараметрУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНаработка.ПараметрУчета КАК ПараметрУчета,
	|	втНаработка.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втНаработка.Экземпляр КАК Экземпляр,
	|	втНаработка.Период КАК Период,
	|	МАКСИМУМ(ЕСТЬNULL(НаработкаЭкземляровКомплектующихИзделийКорабляСрезПоследних.ЗначениеСНачалаЭксплуатации, 0)) КАК ТекущееЗначение
	|ИЗ
	|	втНаработка КАК втНаработка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаработкаЭкземляровКомплектующихИзделийКорабля.СрезПоследних(&Период, Экземпляр = &Экземпляр) КАК НаработкаЭкземляровКомплектующихИзделийКорабляСрезПоследних
	|		ПО втНаработка.ПараметрУчета = НаработкаЭкземляровКомплектующихИзделийКорабляСрезПоследних.ПараметрУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	втНаработка.ПараметрУчета,
	|	втНаработка.ЕдиницаИзмерения,
	|	втНаработка.Экземпляр,
	|	втНаработка.Период";
	Запрос.УстановитьПараметр("Экземпляр", Экземпляр);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ПредметСнабжения", Экземпляр.Владелец.ПредметСнабжения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить("Данное изделие не имеет параметров учета!");
		Возврат;
		
	КонецЕсли;
	
	Наработка.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура НаработкаЗначениеСНачалаЭксплуатацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Наработка.ТекущиеДанные;
	
	ТекущиеДанные.НачалоЦикла = (ТекущиеДанные.ЗначениеСНачалаЭксплуатации > 0);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьПродолжение", ЭтаФорма), "В базу данных будут внесены изменения. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьНаработку();
		Закрыть();
		
	Иначе
		
		ПоказатьПредупреждение(, "Действие отменено");
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаработку()
	
	НаработкаМенеджер = РегистрыСведений.НаработкаЭкземляровКомплектующихИзделийКорабля;	
	
	Для каждого СтрокаНаработка Из Наработка Цикл
		
		Если СтрокаНаработка.НачалоЦикла Тогда
			
			НаработкаМенеджерЗаписи = НаработкаМенеджер.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НаработкаМенеджерЗаписи, СтрокаНаработка);
			НаработкаМенеджерЗаписи.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
